app/views/comments/_comments.html.erb

<% @post.comments.each do |comment| %>
  <% user = User.find_by_id(comment.user_id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]