app/views/likes/_likes.html.erb

      <tr>
        <td><%= @post.likes.count %></td>
        <% @post.likes.each do |like| %>
          <% user = User.find_by_id(like.user_id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]