app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
<table class="table table-hover">
  <% @user.posts.each do |post| %>