app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% @posts.each do |post| %>
  <% user = User.find_by_id(post.user_id) %>