app/views/posts/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
<div class="row">
  <% if @post.likes.all? { |like| like.user_id != session[:user_id] } %>