app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    if @post.likes.all? { |like| like.user_id != session[:user_id] }
      @like = @post.likes.create(user_id: session[:user_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["post_id", 1], ["created_at", "2022-01-10 14:05:50.269815"], ["updated_at", "2022-01-10 14:05:50.269815"]]