app/controllers/posts_controller.rb

  def create
    @post = Post.new(user_id: session[:user_id], title: post_params[:title], body: post_params[:body])
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Igor"], ["body", "Labekin"], ["user_id", 3], ["created_at", "2022-01-10 14:05:41.744442"], ["updated_at", "2022-01-10 14:05:41.744442"]]

  def set_post
    @post = Post.find(params[:id])
    @user = User.find_by_id(@post.user_id)
    @user_session = User.find_by_id(session[:user_id]).name
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]