app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190967], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Ilya1312"], ["updated_at", "2021-12-24 19:36:27.687283"], ["id", 980190967]]

  def set_post
    @post = Post.find(params[:id])
    @user = User.find_by_id(@post.user_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190968], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190968], ["LIMIT", 1]]