app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Igor"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Igor"], ["password_digest", "[FILTERED]"], ["created_at", "2022-01-10 14:02:52.207860"], ["updated_at", "2022-01-10 14:02:52.207860"]]
---
  def create
    if User.find_by_name(user_params[:name])
      redirect_to new_user_path
    else
      @user = User.new(user_params)
      if @user.save

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "test1"], ["password_digest", "[FILTERED]"], ["updated_at", "2022-01-10 14:42:42.091880"], ["id", 4]]
---
  def update
    if @user.update(user_params)