app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% if session[:user_id] != nil %>
        <a class="navbar-brand"><%= t ".welcome"%> <%= User.find_by_id(session[:user_id]).name %></a>